#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-081952a6f22fa4dc3]
module.vpc.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-048937b3cb2b9fcd5]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-08a8f5146114d89b0]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0bb91601b3603c925]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-02cc30541c28c77a4]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-04e892a5576d01b46]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01f3f72d2056ac20e]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c54d42eba5db2472]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ca27a245d42694be]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e0ec5d805b414912]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07cb62a73892b3a72]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-04d61d7ffe2de9462]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c71c8ae5d7a27e44]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ca38d3b48992987e]
module.vpc.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-03a8a9282dd4cab08]
module.ec2_cluster.module.security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0d0293272e527f05d]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-04e892a5576d01b461080289494]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-039f3deaf4635c6f5]
module.vpc.module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-071954bed5c23fa18]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0163a4b358d75ef3a]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-096f5d87bf76f93be]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b2397dae2ff0c1b2]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e3d9950b5a46bd35]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-082a8e135172351a4]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-030b6479c481f3765]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0d4e0c69980f98595]
module.ec2_cluster.module.security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3340119778]
module.ec2_cluster.module.security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-2667735726]
module.ec2_cluster.module.security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-536805538]
module.ec2_cluster.module.ec2_cluster.aws_instance.this[0]: Refreshing state... [id=i-097a0d406d0385fd9]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-02cc30541c28c77a41080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-03a8a9282dd4cab081080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c54d42eba5db24721080289494]
module.ec2_cluster.aws_ebs_volume.this[0]: Refreshing state... [id=vol-03d69f2c208266108]
module.ec2_cluster.aws_volume_attachment.this_ec2[0]: Refreshing state... [id=vai-4089346694]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3.module.s3.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "devooops-meetup-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.s3.module.s3.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @bmbferreira, Action: `pull_request`, Working Directory: `terraform/production`, Workflow: `Awesome Terraform Workflow`*